### 1. 라이브러리 정의

In [35]:
import pandas as pd

### 2. 파일데이터 불러오기

#### 1. 상대경로/절대경로
#### 2. 데이터불러오기(pandas ~ csv ~ sep 활용법 기억)
#### 3. 데이터 불러올 경우 한글 유의

In [36]:
carDataurlpath = "https://raw.githubusercontent.com/hyokwan/python-lecture/master/dataset/cars.csv"

In [37]:
targetData = "https://raw.githubusercontent.com/hyokwan/python-lecture/master/dataset/cars.csv111"

aa = []

try:
    aa = pd.read_csv(targetData)
except Exception as e:
    print(e)
    print(targetData)

HTTP Error 404: Not Found
https://raw.githubusercontent.com/hyokwan/python-lecture/master/dataset/cars.csv111

In [38]:
pd.read_csv("./currData.txt")

      aadd
0       bb
1       dd
2  123sdfs
3   dsfsdf

In [39]:
aa = pd.read_clipboard()

In [40]:
bb = aa.rename(columns={"aa":"kk"})

In [41]:
bb.to_clipboard()

In [42]:
aa = pd.read_clipboard()

In [43]:
indata = pd.read_csv("./currData.txt")

In [44]:
indata

      aadd
0       bb
1       dd
2  123sdfs
3   dsfsdf

### 데이터 저장

In [45]:
indata.to_csv("./outData.csv", index=True)
# 인덱스를 포함하여

In [46]:
indata.to_csv("./outData2.csv", index=False)
# 인덱스를 제외하고

In [47]:
data = pd.read_csv("../dataset/kopo_region_mst_hangul.csv", encoding = "ms949")
# 한글깨짐방지 인코딩 추가

In [48]:
data

   REGIONID REGIONNAME
0       A00       아프리카
1       A01         미국
2       A02         한국
3       A03         독일
4       A04        브라질
..      ...        ...
68      A68      베네수엘라
69      A69        베트남
70      A70       바누아투
71      A71        NaN
72      A99         기타

[73 rows x 2 columns]

In [49]:
data.to_csv("./hangul.csv", encoding = "ms949", index=False)
#

### 데이터 변환 컬럼 이름변경

In [50]:
# 데이터 컬럼 재정의
data.columns = ["salesid", "regionid"]

In [51]:
data

   salesid regionid
0      A00     아프리카
1      A01       미국
2      A02       한국
3      A03       독일
4      A04      브라질
..     ...      ...
68     A68    베네수엘라
69     A69      베트남
70     A70     바누아투
71     A71      NaN
72     A99       기타

[73 rows x 2 columns]

In [52]:
data.rename(columns={"salesid":"sid",
                    "regionid": "sname"}, inplace = True)
# 바뀐게 바뀐게 아니다. 다시 출력해보면 동일하다.
# 그래서 inplace를 사용해서 즉시 변경할 수 있다.(메모리를 최적화 하기위해서)
renamedData = data.rename(columns={"salesid":"sid1",
                    "regionid": "sname1"})
# 새로운  변수에 데이터를 다시 담았다.(기존의 데이터는 두고)
print(data)
print(renamedData)

    sid  sname
0   A00   아프리카
1   A01     미국
2   A02     한국
3   A03     독일
4   A04    브라질
..  ...    ...
68  A68  베네수엘라
69  A69    베트남
70  A70   바누아투
71  A71    NaN
72  A99     기타

[73 rows x 2 columns]
    sid  sname
0   A00   아프리카
1   A01     미국
2   A02     한국
3   A03     독일
4   A04    브라질
..  ...    ...
68  A68  베네수엘라
69  A69    베트남
70  A70   바누아투
71  A71    NaN
72  A99     기타

[73 rows x 2 columns]

In [53]:
data

    sid  sname
0   A00   아프리카
1   A01     미국
2   A02     한국
3   A03     독일
4   A04    브라질
..  ...    ...
68  A68  베네수엘라
69  A69    베트남
70  A70   바누아투
71  A71    NaN
72  A99     기타

[73 rows x 2 columns]

In [82]:
pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.8.6-cp38-cp38-win_amd64.whl (1.1 MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.8.6
Note: you may need to restart the kernel to use updated packages.

In [1]:
pip show sqlAlchemy

Name: SQLAlchemy
Version: 1.3.18
Summary: Database Abstraction Library
Home-page: http://www.sqlalchemy.org
Author: Mike Bayer
Author-email: mike_mp@zzzcomputing.com
License: MIT
Location: c:\users\smart-25\anaconda3\lib\site-packages
Requires:
Required-by:
Note: you may need to restart the kernel to use updated packages.

In [163]:
targetData = "../dataset/kopo_product_volume.csv"

In [164]:
data = pd.read_csv(targetData, encoding = "ms949")

### 데이터 변환(컬럼이름 소문자로 변경)

In [165]:
data.columns = ["regionid1","productgroup",'yearweek','volume222']

### 3. 데이터 저장(postgres에 저장)

In [166]:
import psycopg2
from sqlalchemy import create_engine

In [182]:
localUrl = "postgresql://postgres:postgres@127.0.0.1:5432/postgres"
# DB 커넥션 만들기

In [159]:
remoteUrl = "postgresql://postgres:postgres@192.168.110.9:5432/postgres"
# DB 커넥션 만들기

In [160]:
engine_pg = create_engine(remoteUrl)
# DB 커넥션 열기
# 이 과정을 생략하고 url을 바로 연결해도 가능하다.

In [161]:
resultTableName = "lkr_out"

In [ ]:
try:
    to_sql(sss)
except Exception as e:
    print(e)
    
# 전송에 성공하든 안하든 엔진을 닫는다.   
engine_pg.dispose()

In [180]:
data.to_sql(name = resultTableName, con=engine_pg,
                    if_exists="replace", index = False)
# data라는 변수에 담긴 csv파일을 resultTableName에 담긴 변수이름으로 보낸다.

In [181]:
pd.read_sql_table(table_name="0909_out", con = engine_pg)

    regionid productgroup  yearweek  volume
0        A01       ST0001    201415  810144
1        A01       ST0002    201415  128999
2        A01       ST0001    201418  671464
3        A01       ST0002    201418  134467
4        A01       ST0001    201413  470040
..       ...          ...       ...     ...
260      A01       ST0002    201614  148835
261      A01       ST0001    201641  746061
262      A01       ST0002    201412  151750
263      A01       ST0001    201420  645626
264      A01       ST0002    201420  125863

[265 rows x 4 columns]

In [179]:
data.to_sql("aa",localUrl)

In [177]:
data1

    regionid productgroup  yearweek  volume
0        A01       ST0001    201415  810144
1        A01       ST0002    201415  128999
2        A01       ST0001    201418  671464
3        A01       ST0002    201418  134467
4        A01       ST0001    201413  470040
..       ...          ...       ...     ...
260      A01       ST0002    201614  148835
261      A01       ST0001    201641  746061
262      A01       ST0002    201412  151750
263      A01       ST0001    201420  645626
264      A01       ST0002    201420  125863

[265 rows x 4 columns]

In [ ]:
engine_pg.dispose()

In [193]:
engine_pg.table_names()
# 연결된 서버의 모든 테이블 목록을 보여준다.

['dd_out', 'bb', '09_out', 'jam_out', '0909_out', 'lkr_out']

In [187]:
indata = pd.read_sql(sql = "select * from lkr_out", con = engine_pg)
# 컬럼명 변경을 위해서 연결된 서버의 데이터베이스에서 lkr_out라는 테이블을 불러온다.

In [188]:
indata.columns
# 불러온 테이블의 모든 컬럼명을 보여준다.

Index(['regionid1', 'productgroup', 'yearweek', 'volume222'], dtype='object')

In [189]:
indata.columns = ["q","b","c","d"]

In [192]:
indata.head(2)
# 불러온 테이블의 상위 두개 튜플만 보여준다

     q       b       c       d
0  A01  ST0001  201415  810144
1  A01  ST0002  201415  128999

In [194]:
#저장한 데이터를 불러온다
sqlReadData = pd.read_sql(sql = "select regionid1 from lkr_out", con = engine_pg)

In [195]:
type(sqlReadData)

pandas.core.frame.DataFrame

In [196]:
data1 = pd.read_sql_table(table_name="0909_out", con = engine_pg)

In [197]:
data1

    regionid productgroup  yearweek  volume
0        A01       ST0001    201415  810144
1        A01       ST0002    201415  128999
2        A01       ST0001    201418  671464
3        A01       ST0002    201418  134467
4        A01       ST0001    201413  470040
..       ...          ...       ...     ...
260      A01       ST0002    201614  148835
261      A01       ST0001    201641  746061
262      A01       ST0002    201412  151750
263      A01       ST0001    201420  645626
264      A01       ST0002    201420  125863

[265 rows x 4 columns]